src/Catalogs/ar_Hooks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Hooks</Name>
			<Comment>Реестр hook-обработчиков событий жизненного цикла agent-runtime. META-20.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СобытиеHook</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОбщийМодуль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИмяПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТипОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_Hooks/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника ar_Hooks.
//
// Зона ответственности (META-20):
//   - автозаполнение Наименования на основе ar_Событие + обработчик
//     (модуль.процедура либо метка «код 1С») при пустом наименовании,
//     чтобы карточка отображалась осмысленно (DefaultPresentation = AsDescription);
//   - проверка заполнения с учётом типа обработчика (ar_ТипОбработчика):
//     "Процедура" (или пусто) — обязательны ar_ОбщийМодуль и ar_ИмяПроцедуры;
//     "Код" — обязателен ar_КодОбработчика.
//
// Справочник - реестр hook-обработчиков событий жизненного цикла agent-runtime.
// Каждая запись связывает одно событие lifecycle (ar_Событие) либо с процедурой
// в общем модуле (ar_ОбщийМодуль + ar_ИмяПроцедуры), либо с произвольным кодом 1С
// (ar_КодОбработчика), исполняемым диспетчером в безопасном режиме.

#Область ОбработчикиСобытий

// Платформенный обработчик перед записью.
// Используется для авто-заполнения Наименования на основе события и обработчика.
//
// Параметры:
//  Отказ - Булево - флаг отказа от записи.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Если наименование пустое - формируем из события и обработчика для удобства отображения.
	Если ПустаяСтрока(Наименование) Тогда

		ЧастиНаименования = Новый Массив;

		Если ЗначениеЗаполнено(ar_Событие) Тогда
			ЧастиНаименования.Добавить(Строка(ar_Событие));
		КонецЕсли;

		Если ЭтоОбработчикКодом() Тогда
			ЧастиНаименования.Добавить(НСтр("ru='код 1С'; en='1C code'"));
		ИначеЕсли ЗначениеЗаполнено(ar_ОбщийМодуль) И ЗначениеЗаполнено(ar_ИмяПроцедуры) Тогда
			ЧастиНаименования.Добавить(ar_ОбщийМодуль + "." + ar_ИмяПроцедуры);
		КонецЕсли;

		Если ЧастиНаименования.Количество() > 0 Тогда
			Наименование = СтрСоединить(ЧастиНаименования, ": ");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Платформенный обработчик проверки заполнения.
// FillChecking у ar_ОбщийМодуль / ar_ИмяПроцедуры снят (DontCheck):
// обязательность зависит от типа обработчика и проверяется здесь.
//
// Параметры:
//  Отказ - Булево - флаг отказа.
//  ПроверяемыеРеквизиты - Массив - реквизиты со стандартной проверкой.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоОбработчикКодом() Тогда

		Если ПустаяСтрока(ar_КодОбработчика) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Не заполнен код обработчика (1С).'; en='Handler code (1C) is not filled.'"),
				Ссылка, "Объект.ar_КодОбработчика", , Отказ);
		КонецЕсли;

	Иначе

		Если ПустаяСтрока(ar_ОбщийМодуль) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Не заполнено имя общего модуля.'; en='Common module name is not filled.'"),
				Ссылка, "Объект.ar_ОбщийМодуль", , Отказ);
		КонецЕсли;

		Если ПустаяСтрока(ar_ИмяПроцедуры) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Не заполнено имя процедуры.'; en='Procedure name is not filled.'"),
				Ссылка, "Объект.ar_ИмяПроцедуры", , Отказ);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик задан кодом 1С (а не процедурой общего модуля).
//
// Возвращаемое значение:
//  Булево - Истина, если ar_ТипОбработчика = "Код".
//
Функция ЭтоОбработчикКодом()
	Возврат СокрЛП(ar_ТипОбработчика) = "Код";
КонецФункции

#КонецОбласти
